## Plan Result (sds_dev_ado)




<pre><code>Plan: 10 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.aks_mi_apintegration_contributor[0]
  * azurerm_role_assignment.aks_mi_datasharelanding_contributor[0]
  * azurerm_role_assignment.mi_adhoc_contributor[0]
  * azurerm_role_assignment.mi_audit_contributor[0]
  * azurerm_role_assignment.mi_export_contributor[0]
  * azurerm_role_assignment.mi_landing_contributor[0]
  * azurerm_role_assignment.mi_pds_contributor[0]
  * azurerm_role_assignment.mi_polybasestaging_contributor[0]
  * azurerm_role_assignment.sops-kv-reader
  * azurerm_user_assigned_identity.azure-devops-mi




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.aks_mi_apintegration_contributor[0] will be created
  + resource "azurerm_role_assignment" "aks_mi_apintegration_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.Storage/storageAccounts/miapintegrationdev"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.aks_mi_datasharelanding_contributor[0] will be created
  + resource "azurerm_role_assignment" "aks_mi_datasharelanding_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.Storage/storageAccounts/midatasharelandingdev"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.mi_adhoc_contributor[0] will be created
  + resource "azurerm_role_assignment" "mi_adhoc_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.Storage/storageAccounts/miadhoclandingdev"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.mi_audit_contributor[0] will be created
  + resource "azurerm_role_assignment" "mi_audit_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.Storage/storageAccounts/miauditdev"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.mi_export_contributor[0] will be created
  + resource "azurerm_role_assignment" "mi_export_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.Storage/storageAccounts/miexportdev"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.mi_landing_contributor[0] will be created
  + resource "azurerm_role_assignment" "mi_landing_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.Storage/storageAccounts/milandingdev"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.mi_pds_contributor[0] will be created
  + resource "azurerm_role_assignment" "mi_pds_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.Storage/storageAccounts/mipersistentdev"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.mi_polybasestaging_contributor[0] will be created
  + resource "azurerm_role_assignment" "mi_polybasestaging_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.Storage/storageAccounts/mipolybasestagingdev"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.sops-kv-reader will be created
  + resource "azurerm_role_assignment" "sops-kv-reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/genesis-rg/providers/Microsoft.KeyVault/vaults/dtssharedservicesdevkv"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_user_assigned_identity.azure-devops-mi will be created
  + resource "azurerm_user_assigned_identity" "azure-devops-mi" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "azure-devops-stg-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "managed-identities-stg-rg"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/ado-shared-infra"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "development"
          + "startupMode"  = "always"
        }
      + tenant_id           = (known after apply)
    }

Plan: 10 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":7,"Program":"tfcmt","SHA1":"","Target":"sds_dev_ado","Vars":{}} -->